[UI_TREE]
EDITCfg=编辑设置
MARKCfg=打标设置
3DCfg=3D设置
ImportDxf_Type0Cfg=DXF导入设置
SysCfg=其他设置

[Edit]
EDIT=编辑设置
PointFilterPrecis=滤点精度(mm)
PointFilterAngle=滤点角度(度)
PointPrecisMoveStep=点移动步长(mm)
MICRO=位置微调步长(mm)
MICROROTATE=角度微调步长(度)
CLICK=拾取精度(mm)
UNDO=级数回滚级数
ONETOTWO=断点精度(mm)
ExtendSpace=缩扩精度(mm)
KillAngleSpace=导角精度(mm)
PreViewZoomScale=预览缩放比例
LayerCnt=层级数
JoinDistance=曲线合并最大距离
FastDrawEnable=填充线显示提速
FastDrawEnableOption=关闭|激活

[MARK]
MARK=打标设置
SafeDoorRemark=安全门闭合是否继续打标
SafeDoorRemarkOption=否|是
CloseRedIfMark=打标时是否自动关闭红光
CloseRedIfMarkOption=否|是
RedPreviewLayerNo=红光预览打标速度
EnableMaxMarkNum=加工到指定数目后停止
EnableMaxMarkNumOption=否|是

[3D]
3D=3D设置
3dModelPrecision=3D模型处理精度
3dTrancePrecision=3D数据转换精度
STLOptimize=STL模型贴图优化
STLOptimizeOption=否|是

[ImportDxf_Type0]
ImportDxf_Type0=DXF导入设置
SepArc=圆弧精度(5~255)
SepSpLine=样条曲线精度(5~255)

[Sys]
Sys=其他设置
CIRCLEPRECIS=圆弧精度(mm)
SAMPLECOUNT=圆弧每段采样数
AIIMPORTPRECIS=AI文件导入精度(mm)
PowerFill=填充速度优化
PowerFillOption=否|是
PowerDraw=绘图速度优化
PowerDrawOption=否|是
PowerRPViewFrame=红光预览边框优化
PowerRPViewFrameOption=否|是


[UI_FACE]
ExportSysPara =导出参数...
ImportSysPara =导入参数...
Ok=确定
Cancel=取消
Apply=应用

;3DCALI DLG MAIN
[DLG_6000]
1019=打标参数设置
1021=开始打标
1022=红光预览
1023=循环打标
1024=导出校正文件
1025=导入校正文件
1027=电机基准点
1028=最小调节位置
1029=最大调节位置
1030=校正递增量
1031=基准面焦距
1033=参数设置
6000=校正类型
6001=基本参数
6002=电机位置
3=生成校正文件
4=重置

;3DCALI DLG PARAM
[DLG_140]
1035=打标次数
1036=打标速度(mm/s)
1037=空跳速度(mm/s)
1038=Q频(kHz)
1039=Q释放(us)
1040=电流(A)
1041=功率(%)
1042=模式
1051=应用
2=取消

;3DCALI STRING
[STRINGTABLE]
Motor position=电机位置
Current focus=当前焦距
Wrong motor parameters=电机参数错误
Motor movement failure=电机运动失败
Motor increment out of range (0.01mm~5mm)=电机增量超出范围(0.01mm~5mm)
Focus of base plane out of range (>0mm)=基准面焦距超出范围(>0mm)
Cali data wrong,the focus must be monotonically increasing/decreasing=校正数据错误，焦距必须单调递增/递减
Cali file detected, generation will modify the original file. It is recommended to back up (Export) the file first. Are you sure to continue generating?=校正文件已存在，生成校正表会将原校正文件修改，建议备份（导出）后再生成。是否继续生成？
Generating cali file false: Unable to open/create file=生成校正文件失败：无法打开/创建文件
Generating cali file false: Unable to write file=生成校正文件失败：无法写入文件
Stop Marking=停止打标
Start Marking=开始打标
Failed to stop marking=停止打标失败
Failed to start marking=停止打标失败
Export success=导出成功
Export failed: Can not find cali file or copy file failed=导出失败：找不到校正文件或拷贝文件失败
Import failed: Cali file does not exist=导入失败：校正文件不存在
Import failed: Unknow=导入失败：未知错误
Cali file already exists, do you want to replace it=校正文件已存在，是否覆盖？
Import success=导入成功
Import failed: Please manually copy the cali file to the '\\EMCC\\caliset\\%cardID%\\' directory=导入失败：请手动将校正文件复制到 ' \EMCC\caliset\%cardID%\ ' 目录下
Data is not enough, please input at lease 2 rows=数据太少，请输入至少两行数据
Generation of cali file succeeded=生成校正文件成功
Error: Handle of device.dll is null=错误：device.dll句柄为空
Error: Card number wrong=错误：卡序号错误
Error: Load device.dll or API failed=错误：加载device.dll或其API时失败
Path of cali file wrong or SystemSet.ini not found=校正文件目录错误或SystemSet.ini找不到
Error: Open 3dmarker.dat failed=错误：打开 3dmarker.dat文件失败
Error: Open .dat failed=错误：打开.dat文件失败
Error: Enter mark environment failed=错误：进入打标环境失败
Error: Leave mark environment failed=错误：离开打标环境失败
